fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ПлановыеОтпуска</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Более28Дней</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ПлановыеОтпуска/ВКМ_ПлановыеОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ПлановыеОтпуска</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ДниПлан</name>
    <type>
      <types>DefinedType.ВКМ_Числовой</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//++Симбирёва О.С 02.07.26
	
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Год = Дата(Год, 1, 1);
	
		КоличествоДней = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;
		Движение.ДниПлан = КоличествоДней;
		
	КонецЦикла;
	
	Движения.ВКМ_ПлановыеОтпуска.Записать();
	
//--Симбирёва О.С 02.07.26
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли
